In [1]:
from math import sqrt
from scipy import stats
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from pydataset import data

### In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
df_iris = data("iris")

### print the first 3 rows

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

### print the number of rows and columns (shape)

In [4]:
df_iris.shape

(150, 5)

### print the column names

In [5]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

### print the data type of each column

In [6]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

### print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [7]:
df_iris.describe().T
# I do not believe we need to rescale because all of the data is structured in the same units

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

### Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [ ]:
df_excel = pd.read_excel(io = "/Users/jaredvahle/CodeUp-Datascience/classification-exercises/Spreadsheets_Exercises_Solutions.xlsx", sheet_name = 0)

In [ ]:
df_excel.head()

### assign the first 100 rows to a new dataframe, df_excel_sample

In [ ]:
df_excel_sample = df_excel.head(100)

In [ ]:
df_excel_sample

### print the number of rows of your original dataframe

In [ ]:
df_excel.shape

###  print the first 5 column names

In [ ]:
df_excel_sample.columns[0:5]

### print the column names that have a data type of object

In [ ]:
df_excel.keys()

In [ ]:
df_excel.dtypes

In [ ]:
df_excel.select_dtypes(include = ["object"]).columns

### compute the range for each of the numeric variables.

In [ ]:
only_numeric = df_excel.select_dtypes(include = ["float64"]).drop(axis = 1, labels = ["no_partners_no_dependents","no_dependents_yes_partners","dependents_no_partners","yes_dependents_and_partners","Unnamed: 23","Unnamed: 30"]).copy()

In [54]:
only_numeric

      monthly_charges  total_charges     tenure  average_monthly_charges
0               56.05            NaN   0.000000                     0.00
1               20.00            NaN   0.000000                     0.00
2               61.90            NaN   0.000000                     0.00
3               19.70            NaN   0.000000                     0.00
4               20.25            NaN   0.000000                     0.00
...               ...            ...        ...                      ...
7038            55.15         742.90  13.470535                    55.15
7039            85.10        1873.70  22.017626                    85.10
7040            50.30          92.75   1.843936                    50.30
7041            67.85        4627.65  68.204127                    67.85
7042            59.00        3707.60  62.840678                    59.00

[7043 rows x 4 columns]

In [55]:
numeric_values_range= only_numeric.apply(lambda x: x.max() - x.min())

In [56]:
numeric_values_range

monthly_charges             100.500000
total_charges              8666.000000
tenure                       79.341772
average_monthly_charges     118.750000
dtype: float64

### Read the data from this google sheet into a dataframe, df_google

In [21]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

### print the first 3 rows

In [22]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### print the number of rows and columns

In [23]:
df_google.shape

(891, 12)

### print the column names

In [24]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### print the data type of each column

In [25]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### print the summary statistics for each of the numeric variables

In [26]:
df_google.select_dtypes(include = ["int64","float64"]).describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### print the unique values for each of your categorical variables

In [27]:
df_google.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [28]:
df_google.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [29]:
df_google.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [30]:
df_google.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

### Make a new python module, acquire.py to hold the following data aquisition functions:

In [31]:
import env
import os

def get_connection(db, user=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

### Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [32]:
def get_titanic_data():
    filename = "titanic.csv"

    if os.path.isfile("titanic.csv"):
        return pd.read_csv("titanic.csv")
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv("titanic.csv")

        # Return the dataframe to the calling code
        return df

In [33]:
get_titanic_data().head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

### Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [34]:
def get_iris_data():
    filename = "iris.csv"

    if os.path.isfile("iris.csv"):
        return pd.read_csv("iris.csv")
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('''
SELECT *
FROM species
JOIN measurements ON measurements.species_id = species.species_id;
''', get_connection('iris_db'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv("iris.csv")

        # Return the dataframe to the calling code
        return df

In [35]:
get_iris_data().head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_id
0,1,setosa,1,5.1,3.5,1.4,0.2,1
1,1,setosa,2,4.9,3.0,1.4,0.2,1
2,1,setosa,3,4.7,3.2,1.3,0.2,1
3,1,setosa,4,4.6,3.1,1.5,0.2,1
4,1,setosa,5,5.0,3.6,1.4,0.2,1

### Once you've got your get_titanic_data and get_iris_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for a local filename like titanic.csv or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [36]:
def get_titanic_data():
    filename = "titanic.csv"

    if os.path.isfile("titanic.csv"):
        return pd.read_csv("titanic.csv")
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv("titanic.csv")

        # Return the dataframe to the calling code
        return df

In [37]:
def get_iris_data():
    filename = "iris.csv"

    if os.path.isfile("iris.csv"):
        return pd.read_csv("iris.csv")
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('''
SELECT *
FROM species
JOIN measurements ON measurements.species_id = species.species_id;
''', get_connection('iris_db'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv("iris.csv")

        # Return the dataframe to the calling code
        return df